app/controllers/api/v1/users_controller.rb

  def new
    sources = Source.all
    categories = Category.all
---
SELECT "sources".* FROM "sources"
SELECT "categories".* FROM "categories"

  def create
    user = User.new(user_params)

    if user.valid?
      user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]